tutorials/biofilmPimpleFoam/2d-parallel/0/porosity.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      porosity;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
  inlet
    {
      type            zeroGradient;
    }

  outlet
    {
      type            zeroGradient;
    }

  top
    {
      type            zeroGradient;
    }
    
  bottom
    {
      type            zeroGradient;
    }

  defaultFaces
    {
      type            empty;
    }
}


// ************************************************************************* //
